#+TITLE: Org Babel Edge Cases
#+PROPERTY: header-args :results output :exports both

* Results blocks (generated by evaluation)

#+BEGIN_SRC python :results output
print("hello")
#+END_SRC

#+RESULTS:
: hello

#+BEGIN_SRC python :results value
return [1, 2, 3]
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

** With clock entries
:LOGBOOK:
CLOCK: [2024-01-15 Mon 09:00]--[2024-01-15 Mon 10:00] =>  1:00
:END:

#+BEGIN_SRC python :results output
print("Work done during clocked time")
#+END_SRC

